PROCESSING_TIME = 2  # время первичной обработки запроса (секунды)

REQUEST_ARRIVAL_MIN = 7  # минимальный интервал поступления запроса (секунды)
REQUEST_ARRIVAL_MAX = 13  # максимальный интервал поступления запроса (секунды)
REQUEST_ARRIVAL_TIME_STDDEV = 6

RESPONSE_TIME_MIN = 16  # минимальное время выдачи ответа (секунды)
RESPONSE_TIME_MAX = 20  # максимальное время выдачи ответа (секунды)
RESPONSE_TIME_AVG = 18  # максимальное время выдачи ответа (секунды)

TRANSMISSION_TIME = 3  # время передачи данных через канал связи (секунды)

SUCCESS_PROBABILITY = 0.5  # вероятность того, что запрос будет обработан на первом компьютере

NUM_REQUESTS = 400  # количество запросов для моделирования

SIMULATIONS_COUNT = 5000
